
// !TASK#1

// Пароль і 4 спроби. Завдання виконуємо через while або do while.
// 1.	Запросити у користувача пароль!
// 2. Якщо пароль не вірний повідомити що залишилось 4 спроби!
// - якщо далі невірні паролі спроби зменшуються.
// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".
// 3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".
// 4. Завдання реалізуємо без break і міток!

// let password = prompt('Enter password');
// let count = 5

// while(count > 0 && password.toLowerCase() !== 'logos') {
//    count--
//    password = prompt('Enter password');
//    alert(`You have ${count} attemt`);
// } 
// if (count <= 0) {
//    alert('Wait 2 minutes');
// } 
// else if (password.toLowerCase() == 'logos') {
//    alert('Welcome to the page!')
// }

 // !TASK#2

 // Task2.1
//  1.	Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
// let n = parseInt(prompt('Enter number'));
// let factorial = function (n) {
//    let result = 1;
//    for (let i=1; i<=n; i++) {
//       result = result * i;
//    } return result;
// }
// console.log(factorial(n));
// TASK#2.2
// 2.	Створіть програму, що виводить на екран всі чотиризначні числа
// послідовності 1000 1003 1006 1009 1012 1015 … 9999

// let i=1000
// while (i=i+3) {
//    if(i>1000 && i<9999) {
//       console.log(i)
//    }
//  }
// Task#2.3
// Створіть програму, що виводить на екран перші 
// 55 елементів послідовності 1 3 5 7 9 11 13 15 17 …

// let i = 1;
// let k = 55;
// while(k<=55) {
//    k--
//    i=i+2;
//    console.log(i)
// } 
// 
// Task#2.4
// Створіть програму, що виводить на екран всі 
// невід'ємні елементи послідовності 90 85 80 75 70 65 60 …

// let i = 90;
// while(i!==0) {
//    if(i=i-5) {
//       console.log(i)
//    }
// } 

// Task#2.5
// Створіть програму, що виводить на екран перші 20 елементів
//  послідовності 2 4 8 16 32 64 128 …

// let i = 1;
// let k=20;
// while(k!==21 && k!==0) {
//    k--
//    if(i=i*2) {
//       console.log(i);
//    }
// } 

// Task#2.6
// Виведіть на екран всі числа в послідовності 
// 2a-1(крок зміни лічильника), де початкове значення a = 2 та 
// які менше 10000.
// let a = 2;
// while(a<=10000) {
//    if (a=a*2-1) {
//       console.log(a)
//    }
// }

// Task#2.7
// Виведіть на екран всі двозначні члени послідовності
// 2a+200(крок зміни лічильника), де початкове значення
// змінної a = -166. ---- тут шось натупив не можу розібратись

   // let a = -166;
   // while(a<=99) {
   //    a=2*a+200;
   // } if (a>=99) {
   //    console.log(a)
   // }

// 8.	Написати програму що обчислює піднесення до степеня. 
// В 1й промпт вводиться число,а в 2й промпт степінь. 
// Умови: Степінь може бути додатня, 
// від'ємна або 0. Обрахувати всі можливі варіанти. 
// Задачу бажано виконати використовуючи 1 цикл! 
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;
// ---- тут шось натупив не можу розібратись


// let num = parseInt(prompt('Enter number'));
// let deg = parseInt(prompt('Enter degree'));
// let result = 1
// while (deg<=0) {
//    console.log(result);
// } if (deg>0) {
// result = num * (num, deg -1)
// console.log(result)
// }


